[
    {
        "Id": 1,
        "Days": 14,
        "DurationDisplay": "14 Days - 13 Nights",
        "Itinerary": [
            {
                "M": {
                    "name": {
                        "S": "Arrival in Delhi"
                    },
                    "description": {
                        "S": "Your journey begins with a warm welcome at Indira Gandhi International Airport, where you’ll be greeted and transferred to your hotel. Upon arrival, complete the check-in process and take some time to unwind. Relax and rejuvenate after your travels, preparing for the exciting days ahead. Enjoy the rest of the day at leisure, exploring nearby attractions or simply resting. Experience the charm of Delhi as you settle in for the night. Get ready to dive into the city's rich history and vibrant culture tomorrow. Overnight stay in Delhi. A delightful journey awaits, filled with unforgettable sights and experiences. Let the adventure begin!",
                        "images": [
                            {
                                "src": "/images/1/11.jpg",
                                "alt": "Delhi India Gate"
                            }
                        ]
                    },
                    "Id": {
                        "N": "1"
                    },
                    "day": {
                        "N": "1"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Delhi Sightseeing"
                    },
                    "description": {
                        "S": "Kick off with a morning tour of Old Delhi, passing the majestic Red Fort and visiting Jama Masjid, India’s largest mosque. Glide through Chandni Chowk’s bustling lanes on a rickshaw, soaking in the vibrant market atmosphere, then pay homage at Raj Ghat, Mahatma Gandhi’s memorial. In the afternoon, explore New Delhi’s landmarks: the towering Qutub Minar, the serene Humayun’s Tomb, and a drive past India Gate and Rashtrapati Bhavan. Discover the blend of Mughal grandeur and colonial elegance that defines the city. As the day winds down, relish local cuisine or take a peaceful evening stroll. Overnight in Delhi.",
                        "images": [
                            {
                                "src": "/images/1/4.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "2"
                    },
                    "day": {
                        "N": "2"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Delhi to Mandawa (Shekhawati)"
                    },
                    "description": {
                        "S": [
                            "After breakfast, journey to Mandawa, a gem in Rajasthan’s Shekhawati region. Check into your hotel and later explore its 18th-century havelis adorned with frescoes, each room a unique masterpiece.This quaint town, with its imposing castle, transports you to a bygone era. Overnight stay at hotel in Mandawa.",
                            "Note: The small little beautiful town of Mandawa is in the heart of the Shekhawati region. Known for its wonderful castle and magnificent havelis, Mandawa gives the impression of living in the bygone era. Mandawa can be transcribed as a surprise at every turn. No single room either, in the havelis, is similar to that of the other. Most of the buildings are dated from the 18th century to early 20th century."
                        ],
                        "images": [
                            {
                                "src": "/images/1/3.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "3"
                    },
                    "day": {
                        "N": "3"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Mandawa to Bikaner"
                    },
                    "description": {
                        "S": [
                            "Depart early for Bikaner, stopping en route at Fatehpur to admire its frescoes. Arrive in Bikaner, a desert city famed for its camel culture and ornate wells. Explore its medieval forts and vibrant markets, soaking in its timeless charm. Overnight stay at hotel in Bikaner.",
                            "Bikaner: Lying in the north of the Desert State, the city is dotted with many sand dunes. Bikaner retains the medieval splendor that pervades the city’s lifestyle. More popularly called the camel country, the city is renowned for the best rIding camels in the world. The ship of the desert is an inseparable part of life here. Be it pulling heavy carts, transporting grains or working on wells, camels are the prime helpers. The wells of Bikaner – an important source of water are other attractions of the city. These are built on high plinths with slender minarets towers on each of the Four Corners and can be noticed even from a distance."
                        ],
                        "images": [
                            {
                                "src": "/images/1/7.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "4"
                    },
                    "day": {
                        "N": "4"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Bikaner to Jaisalmer"
                    },
                    "description": {
                        "S": [
                            "Drive to Jaisalmer, the “Golden City,” founded in 1156 AD atop Trikuta Hill. Check into your hotel and explore its golden sandstone architecture. Discover legends of the Bhatti Rajputs as you wander through this desert marvel. Overnight stay at hotel in Jaisalmer.",
                            "Jaisalmer: Rising from the heart of the Thar Desert like a golden mirage is the city of Jaisalmer. A commanding fort etched in yellow sandstone stands, with its awesome splendor, dominating the amber-hued city. The city has an interesting legend associated with it, according to which, Lord Krishna-the head of the Yadav Clan, foretold Arjuna that a remote descendent of the Yadav Clan would build his kingdom atop the Trikuta Hill. His prophecy was fulfilled in 1156 AD when Rawal Jaisal, a descendent of the Yadav Clan and a Bhatti Rajput, abandoned his fort at Lodurva and founded a new capital -Jaisalmer, perched on the Trikuta Hill."
                        ],
                        "images": [
                            {
                                "src": "/images/1/5.jpeg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "5"
                    },
                    "day": {
                        "N": "5"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Jaisalmer Sightseeing"
                    },
                    "description": {
                        "S": [
                            "Following breakfast, embark on a full-day exploration of Jaisalmer, the 'Golden City,' nestled in the heart of the Great Indian Desert. Bathed in golden hues, the city’s temples, forts, and palaces—crafted entirely from yellow sandstone—unfold like an open-air museum of intricate carvings, ornate façades, and latticed balconies. Begin with the UNESCO-listed Jaisalmer Fort, the world’s oldest living fort and the tour’s crown jewel.",
                            "Wander through its labyrinthine lanes, marveling at the opulent Patwon-Ki-Haveli with its delicate filigree work, the whimsically curved Salim-Singh-Ki-Haveli, and the tranquil Gandhi Sagar Tank. As the afternoon sun softens, journey to the Sam Sand Dunes to experience a quintessential Rajasthani desert village. Climb the rolling dunes for a front-row seat to nature’s grand finale: a fiery sunset that ignites the sky in shades of amber and crimson. Return to your hotel under a canopy of stars, reflecting on the day’s wonders, and settle in for an overnight stay in Jaisalmer."
                        ],
                        "images": [
                            {
                                "src": "/images/1/6.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "6"
                    },
                    "day": {
                        "N": "6"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Jaisalmer to Jodhpur/Luni"
                    },
                    "description": {
                        "S": [
                            "After breakfast at the hotel, depart for Jodhpur, an imperial city steeped in history and perched on the edge of the Thar Desert. Known as the former capital of Marwar and the stronghold of the Rathor dynasty, Jodhpur invites exploration of its regal heritage.",
                            "Begin your sightseeing at Mehrangarh Fort, a formidable structure towering over the city on a rocky hilltop. Wander through its palaces adorned with intricate miniature paintings and visit the poignant cradle room, a testament to royal lineage. Next, explore the serene Jaswant Thada Memorial, a cluster of exquisite marble cenotaphs shimmering in the sunlight. Later, continue your journey to Luni, where you’ll check into Fort Chanwa, a striking red sandstone fortress that blends history with luxury. Conclude the day with an overnight stay in Luni, immersed in the grandeur of Rajasthan’s architectural legacy."
                        ],
                        "images": [
                            {
                                "src": "/images/1/2.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "7"
                    },
                    "day": {
                        "N": "7"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Jodhpur to Udaipur via Ranakpur"
                    },
                    "description": {
                        "S": [
                            "Depart for Udaipur, pausing en route to explore the awe-inspiring Ranakpur Temples, a 500-year-old Jain marvel renowned for its immaculate preservation. Wander through these sprawling, architecturally intricate temples, where 1,444 exquisitely carved pillars—each distinct in design—stand as testaments to artistic mastery. The complex features 29 grand halls, 80 domes, and elegant pavilions adorned with celestial nymphs frozen in dance, their delicate engravings highlighting the site’s brilliance. After marveling at this symphony of stone, continue your journey to Udaipur, the enchanting 'City of Lakes,' where you’ll check into your hotel for an overnight stay."
                        ],
                        "images": [
                            {
                                "src": "/images/1/8.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "8"
                    },
                    "day": {
                        "N": "8"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Udaipur Sightseeing"
                    },
                    "description": {
                        "S": [
                            "After breakfast, embark on a sightseeing tour of Rajasthan’s enchanting lake cities. Begin with a visit to the majestic City Palace, where intricately carved balconies, grand arches, and lavishly decorated pillars reflect the opulence of Rajput and Mughal architecture. Explore its historic chambers, including the Zanana Mahal (women’s quarters), the regal Durbar Hall, and the ornate Shambhu Niwas. As the day transitions to evening, indulge in a serene boat ride on Lake Pichola, where the golden hues of the sunset cast a magical glow over the water. Admire the panoramic vistas of rolling hills, shimmering palaces, ancient temples, and bustling bathing ghats that frame the lake’s shores. Return to your hotel afterward for a restful overnight stay, reflecting on the day’s blend of history and natural beauty."
                        ],
                        "images": [
                            {
                                "src": "/images/1/9.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "9"
                    },
                    "day": {
                        "N": "9"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Udaipur to Pushkar"
                    },
                    "description": {
                        "S": [
                            "After breakfast, depart for Pushkar, a town steeped in spiritual lore and revered as the 'king of all tiraths (pilgrimage sites).' The heart of Pushkar is its sacred semicircular lake, flanked by 52 ghats (steps leading to the water), with a maximum depth of 10 meters. Pilgrims flock here to take a holy dip, especially during Karthik Purnima—a full moon in the Hindu month of Kartik—believed to cleanse sins and grant salvation. Bathing during the brighter fortnight of Kartik and glimpsing the idol of Varah (Vishnu’s boar incarnation) is said to break the cycle of rebirth, with the Purnima dip equating to the blessings of a hundred penances. Mythologically, Pushkar is said to host countless yojana (pilgrimage spots), surpassing even the count known to Brihaspati, the celestial teacher of gods. By evening, return to your hotel for a peaceful overnight stay, reflecting on the town’s divine aura."
                        ],
                        "images": [
                            {
                                "src": "/images/1/10.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "10"
                    },
                    "day": {
                        "N": "10"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Pushkar to Jaipur"
                    },
                    "description": {
                        "S": [
                            "Drive to Jaipur, the vibrant capital of Rajasthan, famously known as the Pink City for its stunning pink-hued architecture. This historic city is renowned for its magnificent forts, palaces, and serene lakes, offering a glimpse into its royal past. Steeped in culture, history, and rich traditions, Jaipur captivates visitors with its bustling markets, grand heritage sites, and warm hospitality. Nestled against the Aravalli Hills, the city enjoys natural protection from the vast Thar Desert, adding to its unique landscape. After a day of exploration, unwind with an overnight stay at a hotel, preparing for more adventures ahead."
                        ],
                        "images": [
                            {
                                "src": "/images/1/1.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "11"
                    },
                    "day": {
                        "N": "11"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Jaipur Sightseeing"
                    },
                    "description": {
                        "S": [
                            "Visit the magnificent Amber Fort, constructed during the reign of Raja Man Singh, and experience a memorable elephant ride to the hilltop. Explore the grandeur of City Palace, showcasing a perfect blend of Rajasthani and Mughal architecture. Walk through Chandra Palace, the seven-storied centerpiece offering breathtaking views of the city. Step into Jantar Mantar, a remarkable solar observatory equipped with precise astronomical instruments. Marvel at the iconic Hawa Mahal, the five-story pink sandstone masterpiece built in 1799. Admire its 593 intricately carved stone Jharokas, designed to allow royal women to observe the lively streets while remaining unseen."
                        ],
                        "images": [
                            {
                                "src": "/images/1/12.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "12"
                    },
                    "day": {
                        "N": "12"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Jaipur to Agra via Fatehpur Sikri"
                    },
                    "description": {
                        "S": [
                            "Visit the magnificent Amber Fort, constructed during the reign of Raja Man Singh, and experience a memorable elephant ride to the hilltop. Explore the grandeur of City Palace, showcasing a perfect blend of Rajasthani and Mughal architecture. Walk through Chandra Palace, the seven-storied centerpiece offering breathtaking views of the city. Step into Jantar Mantar, a remarkable solar observatory equipped with precise astronomical instruments. Marvel at the iconic Hawa Mahal, the five-story pink sandstone masterpiece built in 1799. Admire its 593 intricately carved stone Jharokas, designed to allow royal women to observe the lively streets while remaining unseen."
                        ],
                        "images": [
                            {
                                "src": "/images/1/13.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "13"
                    },
                    "day": {
                        "N": "13"
                    }
                }
            },
            {
                "M": {
                    "name": {
                        "S": "Agra / Delhi Departure"
                    },
                    "description": {
                        "S": [
                            "Start the day with a breathtaking sunrise visit to the Taj Mahal, the iconic Monument of Love built by Mughal Emperor Shah Jahan as a tribute to his wife, Mumtaz Mahal. Shah Jahan was later laid to rest beside her in this magnificent tomb, which took 22 years and 20,000 workers to complete. The stunning white marble was sourced from Makrana, Rajasthan, and adorned with intricate inlay work of precious and semi-precious stones, reflecting the grandeur of Mughal architecture. After this mesmerizing experience, return to the hotel for breakfast.",
                            "Explore the grandeur of Agra Fort, a massive Mughal fortress known for its impressive architecture and rich history.",
                            "Continue the journey with a visit to Itmad-Ud-Daulah’s Tomb, designed in the elegant Charbagh style. Built under the guidance of Itmad-Ud-Daulah himself, this tomb showcases delicate inlay work, including intricate patterns like a wine flask with snake-shaped handles. It also serves as the final resting place for other family members.",
                            "Next, head to Mughal Emperor Akbar’s Tomb in Sikandra, located just 3 km from Agra. Akbar initiated its construction, and his son Jehangir completed it, incorporating Indo-Saracenic architectural elements reminiscent of the Taj Mahal."
                        ],
                        "images": [
                            {
                                "src": "/images/1/14.jpg",
                                "alt": "delhi chandni chowk rickshaw ride"
                            }
                        ]
                    },
                    "Id": {
                        "N": "14"
                    },
                    "day": {
                        "N": "14"
                    }
                }
            }
        ],
        "Name": "Forts and Palaces of India",
        "Tags": [
            "cultural",
            "traditional "
        ],
        "LocationDescription": "Delhi-Mandawa-Bikaner-Jaisalmer-Jodhpur-Luni-Ranakpur-Udaipur-Pushkar-Jaipur-Jaipur-Fatehpur Sikri-Agra",
        "Uri": "forts-and-palaces-india",
        "Title": "Explore Fort and Palaces of India Tour - Eaze Tours",
        "Description": "Explore the majestic Fort and Palaces of India with Eaze Tours. Experience royal heritage, stunning architecture, and timeless stories on your journey.",
        "NoOfRatings": 19,
        "Summary": "Embark on a journey through India’s most iconic forts and palaces, where history, grandeur, and architectural brilliance come to life. From the majestic Amer Fort to the opulent Mysore Palace, each destination offers a glimpse into the country’s regal past. To explore more of Rajasthan’s royal heritage, check out our <a href='https://www.eazetours.com/packages/royal-rajasthan-tour-package-india' class='text-[#025C7A] font-semibold'>Rajasthan Tour Packages</a> for a deeper dive into its vibrant culture. For a truly luxurious experience, consider the <a href='https://www.eazetours.com/packages/palace-on-wheels-tour-package-india' class='text-[#025C7A] font-semibold'>Palace on Wheels Tour Package</a>—a royal train journey that takes you through Rajasthan’s most magnificent landmarks in unparalleled comfort. Let <a href='https://www.eazetours.com' class='text-[#025C7A] font-semibold'>Eaze Tours</a> craft an unforgettable adventure through India’s royal splendor!",
        "Overview": "Embark on a captivating 14-day journey through India's most iconic forts and palaces, immersing yourself in the rich history, architectural grandeur, and vibrant cultures of Rajasthan and beyond. This meticulously crafted itinerary offers a blend of guided tours, cultural experiences, and leisure time, ensuring a comprehensive exploration of India's royal heritage.",
        "Ratings": 4.9
    }
]
